baseALM_DevonwayDeploymentPolicyRequest.xml

<?xml version="1.0"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dp="http://www.datapower.com/schemas/management" xmlns:fo="http://www.w3.org/1999/XSL/Format">
	<env:Body>
		<dp:request domain="@DOMAIN@">
			<dp:set-config>
				<ConfigDeploymentPolicy name="@DEPLOYMENTPOLICYNAME@">
					<ModifiedConfig>
						<Match>*/*/network/mq-qm?Name=ALM_Gateway_sequence_Qmgr&amp;Property=HostName</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_Gateway_sequence_Qmgr.mq.Hostame@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/network/mq-qm?Name=ALM_Gateway_sequence_Qmgr&amp;Property=ChannelName</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_Gateway_sequence_Qmgr.mq.ChannelName@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/network/mq-qm?Name=ALM_Gateway_sequence_Qmgr&amp;Property=MaximumMessageSize</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_Gateway_sequence_Qmgr.mq.MaximumMessageSize@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/network/mq-qm?Name=ALM_Gateway_sequence_Qmgr&amp;Property=TotalConnectionLimit</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_Gateway_sequence_Qmgr.mq.TotalConnectionLimit@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/network/mq-qm?Property=LocalAddress</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALL.mq.MQ_LOCAL_IP_ADDRESS@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/network/mq-qm?Name=ALM_Location&amp;Property=HostName</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_Location.mq.Hostame@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/network/mq-qm?Name=ALM_Location&amp;Property=ChannelName</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_Location.mq.ChannelName@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/network/mq-qm?Name=ALM_Location&amp;Property=MaximumMessageSize</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_Location.mq.MaximumMessageSize@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/network/mq-qm?Name=ALM_Location&amp;Property=TotalConnectionLimit</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_Location.mq.TotalConnectionLimit@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/network/mq-qm?Name=ALM_Location&amp;Property=LocalAddress</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_Location.mq.LocalAddress@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/network/user-agent?Name=ALM_Location_User_Agent&amp;Property=BasicAuthPolicies/UserName&amp;Value=.*</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_Location_User_Agent.userAgent.userName@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/network/user-agent?Name=ALM_Location_User_Agent&amp;Property=BasicAuthPolicies/PasswordAlias&amp;Value=.*</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_Location_User_Agent.userAgent.passwordAlias@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/network/mq-qm?Name=ALM_Location_QManager&amp;Property=HostName</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_Location_QManager.mq.Hostame@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/network/mq-qm?Name=ALM_Location_QManager&amp;Property=ChannelName</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_Location_QManager.mq.ChannelName@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/network/mq-qm?Name=ALM_Location_QManager&amp;Property=MaximumMessageSize</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_Location_QManager.mq.MaximumMessageSize@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/network/mq-qm?Name=ALM_Location_QManager&amp;Property=TotalConnectionLimit</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_Location_QManager.mq.TotalConnectionLimit@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/network/mq-qm?Name=ALM_Location_QManager&amp;Property=LocalAddress</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_Location_QManager.mq.LocalAddress@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/crypto/key?Name=ALM_cryptokey&amp;Property=Filename</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_cryptokey.crypto.key.FileName@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/crypto/key?Name=ALM_cryptokey&amp;Property=Alias</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_cryptokey.crypto.key.PasswordAlias@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/crypto/cert?Name=ALM_cryptocert&amp;Property=Filename</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_cryptocert.crypto.cert.FileName@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/crypto/cert?Name=SectigoRSAOrganizationValidationSecureServerCA_crypto_cert&amp;Property=Filename</Match>
						<Type>change</Type>
						<Property/>
						<Value>@SectigoRSAOrganizationValidationSecureServerCA_crypto_cert.crypto.cert.FileName@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/crypto/cert?Name=AAACertificateServices_crypto_cert&amp;Property=Filename</Match>
						<Type>change</Type>
						<Property/>
						<Value>@AAACertificateServices_crypto_cert.crypto.cert.FileName@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/crypto/cert?Name=USERTrustRSACertificationAuthority_crypto_cert&amp;Property=Filename</Match>
						<Type>change</Type>
						<Property/>
						<Value>@USERTrustRSACertificationAuthority_crypto_cert.crypto.cert.FileName@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/protocol/https?Name=ALM_gateway_HTTPS_Handler&amp;Property=LocalAddress</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_gateway_HTTPS_Handler.httpsfsh.LocalAddress@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/protocol/https?Name=ALM_gateway_HTTPS_Handler&amp;Property=LocalPort</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_gateway_HTTPS_Handler.httpsfsh.LocalPort@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/services/multiprotocol-gateway?Name=ALM_gateway&amp;Property=StylesheetParameters/ParameterValue&amp;Value=dpmq://ALM_Gateway_sequence_Qmgr/?RequestQueue=SEQ.REQUEST</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_gateway.mpg.params.ALM_Location_SequanceUrl.value@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/services/multiprotocol-gateway?Name=ALM_gateway&amp;Property=StylesheetParameters/ParameterValue&amp;Value=1</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_gateway.mpg.params.expiry.value@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/services/multiprotocol-gateway?Name=ALM_gateway&amp;Property=StylesheetParameters/ParameterValue&amp;Value=5</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_gateway.mpg.params.waitTime.value@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/services/multiprotocol-gateway?Name=ALM_Location&amp;Property=StylesheetParameters/ParameterValue&amp;Value=dpmq://ALM_Gateway_sequence_Qmgr/?RequestQueue=SEQ.REQUEST</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_Location.mpg.params.ALM_Location_SeqConfUrl.value@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/services/multiprotocol-gateway?Name=ALM_Location&amp;Property=StylesheetParameters/ParameterValue&amp;Value=RTM</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_Location.mpg.params.IPMPClass.value@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/services/multiprotocol-gateway?Name=ALM_Location&amp;Property=StylesheetParameters/ParameterValue&amp;Value=DTEEnergy-Fermi2</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_Location.mpg.params.ReportingAuthority.value@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/services/multiprotocol-gateway?Name=ALM_Location&amp;Property=StylesheetParameters/ParameterValue&amp;Value=HVIPK14696</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_Location.mpg.params.key.value@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/network/mq-qm?Name=ALM_Gateway_sequence_Qmgr&amp;Property=CSPUserId&amp;Value=.*appid*</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_Gateway_sequence_Qmgr.mq.CSPUserId@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/network/mq-qm?Name=ALM_Gateway_sequence_Qmgr&amp;Property=CSPPasswordAlias&amp;Value=.*appid*</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_Gateway_sequence_Qmgr.mq.CSPPasswordAlias@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/network/mq-qm?Name=ALM_Location&amp;Property=CSPUserId&amp;Value=.*appid*</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_Location.mq.CSPUserId@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/network/mq-qm?Name=ALM_Location&amp;Property=CSPPasswordAlias&amp;Value=.*appid*</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_Location.mq.CSPPasswordAlias@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/network/mq-qm?Name=ALM_Location_QManager&amp;Property=CSPUserId&amp;Value=.*appid*</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_Location_QManager.mq.CSPUserId@</Value>
					</ModifiedConfig>
					<ModifiedConfig>
						<Match>*/*/network/mq-qm?Name=ALM_Location_QManager&amp;Property=CSPPasswordAlias&amp;Value=.*appid*</Match>
						<Type>change</Type>
						<Property/>
						<Value>@ALM_Location_QManager.mq.CSPPasswordAlias@</Value>
					</ModifiedConfig>
				</ConfigDeploymentPolicy>
			</dp:set-config>
		</dp:request>
	</env:Body>
</env:Envelope>
